# Задание 2: Создание и использование собственного модуля

# 1.	Создайте модуль my_module.py, который содержит минимум одну функцию. Например, функция может принимать два аргумента и возвращать их сумму.
# 2.	Импортируйте my_module в другой файл Python и вызовите функцию, определённую в модуле.

import my_module

print(my_module.welcome())
print()
print(my_module.sm(2,2))
print()
print(my_module.multiply(1,2,3,4,5))









